# Brewfile

# cli
brew "gh"
brew "micro"
brew "fastfetch"
brew "zsh"
brew "git"
brew "stow"
brew "eza"
brew "bat"
brew "mackup"

# casks
cask "alt-tab"
cask "bruno"
cask "grandperspective"
cask "helium-browser"
cask "jordanbaird-ice"
cask "linearmouse"
cask "localsend"
cask "raycast"
cask "tomatobar"
cask "utm"
cask "iina"
cask "keka"
cask "iterm2"
cask "spotify"
